In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('data.csv')
df.head()

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [4]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [5]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [7]:
# Handling missing values
df.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [11]:
df[df.isnull().any(axis=1)]

          Date Category  Value   Product  Sales Region
11  2023-01-12        B   60.0  Product2    NaN   West
15  2023-01-16        C    NaN  Product1  895.0  North
17  2023-01-18        C    NaN  Product1  108.0   West
28  2023-01-29        B    NaN  Product3  617.0  North
33  2023-02-03        C   27.0  Product3    NaN   East
35  2023-02-05        B   60.0  Product2    NaN   West
37  2023-02-07        C    2.0  Product1    NaN  North

In [13]:
# Filling missing value by 0

df_filled = df.fillna(0)    
df_filled.isnull().sum()

Date        0
Category    0
Value       0
Product     0
Sales       0
Region      0
dtype: int64

In [16]:
# Filling missing values by mean of the column which is meaningful

df['Sales'] = df['Sales'].fillna(df['Sales'].mean())
df.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       0
Region      0
dtype: int64

In [22]:
print(df['Sales'].at[11])
print(df['Sales'].at[33])
print(df['Sales'].at[35])
print(df['Sales'].at[37])

557.1304347826087
557.1304347826087
557.1304347826087
557.1304347826087

In [23]:
# Renaming the column

df = df.rename(columns={'Date':'Sales Date'})
df.head()

   Sales Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [25]:
# Change the data type

df['Value_new'] = df['Value'].fillna(df['Value'].mean()).astype(int)
df.dtypes

Sales Date     object
Category       object
Value         float64
Product        object
Sales         float64
Region         object
Value_new       int32
dtype: object

In [26]:
# Let's increase the value column by 200%
df['Value'] = df['Value']*2

# df['Value'] = df['Value'].apply(lambda x:x*2)
df.head()

   Sales Date Category  Value   Product  Sales Region  Value_new
0  2023-01-01        A   56.0  Product1  754.0   East         28
1  2023-01-02        B   78.0  Product3  110.0  North         39
2  2023-01-03        C   64.0  Product2  398.0   East         32
3  2023-01-04        B   16.0  Product1  522.0   East          8
4  2023-01-05        B   52.0  Product3  869.0  North         26

In [27]:
# Data Aggregating and grouping

grouped_mean = df.groupby('Product')['Value'].mean()
print(grouped_mean)

Product
Product1     92.428571
Product2    105.600000
Product3    110.333333
Name: Value, dtype: float64

In [28]:
grouped_sum = df.groupby(['Product','Region'])['Value'].sum()
print(grouped_sum)

Product   Region
Product1  East      584.0
          North      18.0
          South     200.0
          West      492.0
Product2  East      112.0
          North     254.0
          South     362.0
          West      856.0
Product3  East      404.0
          North     406.0
          South     430.0
          West      746.0
Name: Value, dtype: float64

In [29]:
# Aggregate multiple function

grouped_agg = df.groupby('Region')['Value'].agg(['mean','sum','count'])
print(grouped_agg)

              mean     sum  count
Region
East     84.615385  1100.0     13
North    75.333333   678.0      9
South   124.000000   992.0      8
West    123.176471  2094.0     17

In [33]:
# Merging dataframes

df1 = pd.DataFrame({'Key':['A','B','C'], 'Value1':[1,2,3]})
df2 = pd.DataFrame({'Key':['A','B','D'], 'Value2':[4,5,6]})

In [34]:
# Inner join

pd.merge(df1,df2,how="inner",on="Key")

  Key  Value1  Value2
0   A       1       4
1   B       2       5

In [35]:
# Full outer join

pd.merge(df1,df2,how="outer")

  Key  Value1  Value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [36]:
# Left join

pd.merge(df1,df2,how="left",on="Key")

  Key  Value1  Value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [37]:
# Right join

pd.merge(df1,df2,how="right",on="Key")

  Key  Value1  Value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6